app/controllers/cidades_controller.rb

SELECT * FROM "cidades"
---
  def index
    @cidades = Cidade.all

SELECT * FROM "cidades" WHERE ("cidades"."id" = 953125641)
---
  def show
    @cidade = Cidade.find(params[:id])

SELECT * FROM "cidades" WHERE ("cidades"."id" = 953125641)
---
  def edit
    @cidade = Cidade.find(params[:id])

INSERT INTO "cidades" ("created_at", "updated_at", "descricao") VALUES('2009-04-28 12:38:27.884835', '2009-04-28 12:38:27.884835', E'IGUATU') RETURNING "id"
---
  def create
    @cidade = Cidade.new(params[:cidade])

    respond_to do |format|
      if @cidade.save

SELECT * FROM "cidades" WHERE ("cidades"."id" = 953125641)
---
  def update
    @cidade = Cidade.find(params[:id])

SELECT * FROM "cidades" WHERE ("cidades"."id" = 953125641)
DELETE FROM "cidades" WHERE "id" = 953125641
---
  def destroy
    @cidade = Cidade.find(params[:id])
    @cidade.destroy