app/controllers/funcionarios_controller.rb

SELECT * FROM "funcionarios"
---
  def index
    @funcionarios = Funcionario.all

SELECT * FROM "funcionarios" WHERE ("funcionarios"."id" = 953125641)
---
  def show
    @funcionario = Funcionario.find(params[:id])

SELECT * FROM "funcionarios" WHERE ("funcionarios"."id" = 953125641)
---
  def edit
    @funcionario = Funcionario.find(params[:id])

INSERT INTO "funcionarios" ("tipo", "endereco", "complemento", "cadastro_pis", "created_at", "cidade_id", "fone", "pai", "zona_eleitoral", "cod_agencia_pis", "endereco_banco_pis", "demissao", "nome", "cep", "cpf", "numero_pis", "updated_at", "nascimento", "nome_agencia_pis", "observacao", "uf", "mae", "numero_carteira_trabalho", "serie_carteira_trabalho", "admissao", "aci", "titulo_eleitor", "registro", "estado_civil", "cod_banco_pis", "nome_banco_pis", "rg", "naturalidade", "grau_instrucao", "email") VALUES(E'1', E'RUA DA PAZ, 343', E'centro', '2009-04-28', '2009-04-28 12:40:40.088166', 0, E'35114068', E'NAO CONSTA', E'223', E'', E'', '2009-04-28', E'LUCIANO BEZERRA', E'63500000', E'51955326304', E'', '2009-04-28 12:40:40.088166', '2009-04-28', E'', E'', E'CE', E'RITA BEZERRA', E'2521424', E'232', '2004-04-01', E'', E'212514442', '2004-04-01', E'CASADO', E'', E'', E'245096', E'IGUATU', E'SUPERIOR', E'') RETURNING "id"
---
  def create
    @funcionario = Funcionario.new(params[:funcionario])

    respond_to do |format|
      if @funcionario.save

SELECT * FROM "funcionarios" WHERE ("funcionarios"."id" = 953125641)
---
  def update
    @funcionario = Funcionario.find(params[:id])

SELECT * FROM "funcionarios" WHERE ("funcionarios"."id" = 953125641)
DELETE FROM "funcionarios" WHERE "id" = 953125641
---
  def destroy
    @funcionario = Funcionario.find(params[:id])
    @funcionario.destroy