app/controllers/item_pedidos_controller.rb

  def index
    @item_pedidos = ItemPedido.all
---
SELECT * FROM "item_pedidos"

  def show
    @item_pedido = ItemPedido.find(params[:id])
---
SELECT * FROM "item_pedidos" WHERE ("item_pedidos"."id" = 953125641)

  def edit
    @item_pedido = ItemPedido.find(params[:id])
---
SELECT * FROM "item_pedidos" WHERE ("item_pedidos"."id" = 953125641)

  def update
    @item_pedido = ItemPedido.find(params[:id])
---
SELECT * FROM "item_pedidos" WHERE ("item_pedidos"."id" = 953125641)

  def destroy
    @item_pedido = ItemPedido.find(params[:id])
    @item_pedido.destroy
---
SELECT * FROM "item_pedidos" WHERE ("item_pedidos"."id" = 953125641)
DELETE FROM "item_pedidos" WHERE "id" = 953125641