app/controllers/itens_minutas_controller.rb

  def index
    @itens_minutas = ItensMinuta.all
---
SELECT * FROM "itens_minutas"

  def show
    @itens_minuta = ItensMinuta.find(params[:id])
---
SELECT * FROM "itens_minutas" WHERE ("itens_minutas"."id" = 953125641)

  def edit
    @itens_minuta = ItensMinuta.find(params[:id])
---
SELECT * FROM "itens_minutas" WHERE ("itens_minutas"."id" = 953125641)

  def create
    @itens_minuta = ItensMinuta.new(params[:itens_minuta])

    respond_to do |format|
      if @itens_minuta.save
---
INSERT INTO "itens_minutas" ("produto_id", "created_at", "updated_at", "qtde") VALUES(NULL, '2009-04-28 12:39:39', '2009-04-28 12:39:39', NULL)

  def update
    @itens_minuta = ItensMinuta.find(params[:id])
---
SELECT * FROM "itens_minutas" WHERE ("itens_minutas"."id" = 953125641)

  def destroy
    @itens_minuta = ItensMinuta.find(params[:id])
    @itens_minuta.destroy
---
SELECT * FROM "itens_minutas" WHERE ("itens_minutas"."id" = 953125641)
DELETE FROM "itens_minutas" WHERE "id" = 953125641