app/controllers/meta_produtos_controller.rb

  def index
    @meta_produtos = MetaProduto.all
---
SELECT * FROM "meta_produtos"

  def show
    @meta_produto = MetaProduto.find(params[:id])
---
SELECT * FROM "meta_produtos" WHERE ("meta_produtos"."id" = 953125641)

  def edit
    @meta_produto = MetaProduto.find(params[:id])
---
SELECT * FROM "meta_produtos" WHERE ("meta_produtos"."id" = 953125641)

  def create
    @meta_produto = MetaProduto.new(params[:meta_produto])

    respond_to do |format|
      if @meta_produto.save
---
INSERT INTO "meta_produtos" ("created_at", "ano", "updated_at", "data_ini", "mes", "qdt_dias_uteis", "data_fim") VALUES('2009-04-28 12:39:39', NULL, '2009-04-28 12:39:39', NULL, NULL, NULL, NULL)

  def update
    @meta_produto = MetaProduto.find(params[:id])
---
SELECT * FROM "meta_produtos" WHERE ("meta_produtos"."id" = 953125641)

  def destroy
    @meta_produto = MetaProduto.find(params[:id])
    @meta_produto.destroy
---
SELECT * FROM "meta_produtos" WHERE ("meta_produtos"."id" = 953125641)
DELETE FROM "meta_produtos" WHERE "id" = 953125641