app/controllers/minutas_controller.rb

SELECT * FROM "minutas"
---
  def index
    @minutas = Minuta.all

SELECT * FROM "minutas" WHERE ("minutas"."id" = 953125641)
---
  def show
    @minuta = Minuta.find(params[:id])

SELECT * FROM "minutas" WHERE ("minutas"."id" = 953125641)
---
  def edit
    @minuta = Minuta.find(params[:id])

INSERT INTO "minutas" ("obs", "funcionario_fechamento_financeiro_id", "data", "created_at", "fechamento", "fechamento_financeiro", "updated_at", "saida", "veiculo_id", "roteiro_id", "operador_fechamento_id") VALUES(NULL, NULL, NULL, '2009-04-28 12:39:39', NULL, NULL, '2009-04-28 12:39:39', NULL, NULL, NULL, NULL)
---
  def create
    @minuta = Minuta.new(params[:minuta])

    respond_to do |format|
      if @minuta.save

SELECT * FROM "minutas" WHERE ("minutas"."id" = 953125641)
---
  def update
    @minuta = Minuta.find(params[:id])

SELECT * FROM "minutas" WHERE ("minutas"."id" = 953125641)
DELETE FROM "minutas" WHERE "id" = 953125641
---
  def destroy
    @minuta = Minuta.find(params[:id])
    @minuta.destroy