app/controllers/pedidos_controller.rb

  def index
    @pedidos = Pedido.all
---
SELECT * FROM "pedidos"

  def show
    @pedido = Pedido.find(params[:id])
---
SELECT * FROM "pedidos" WHERE ("pedidos"."id" = 953125641)

  def edit
    @pedido = Pedido.find(params[:id])
---
SELECT * FROM "pedidos" WHERE ("pedidos"."id" = 953125641)

  def update
    @pedido = Pedido.find(params[:id])
---
SELECT * FROM "pedidos" WHERE ("pedidos"."id" = 953125641)

  def destroy
    @pedido = Pedido.find(params[:id])
    @pedido.destroy
---
SELECT * FROM "pedidos" WHERE ("pedidos"."id" = 953125641)
DELETE FROM "pedidos" WHERE "id" = 953125641