app/controllers/roteiros_controller.rb

SELECT * FROM "roteiros"
---
  def index
    @roteiros = Roteiro.all

SELECT * FROM "roteiros" WHERE ("roteiros"."id" = 953125641)
---
  def show
    @roteiro = Roteiro.find(params[:id])

SELECT * FROM "roteiros" WHERE ("roteiros"."id" = 953125641)
---
  def edit
    @roteiro = Roteiro.find(params[:id])

INSERT INTO "roteiros" ("created_at", "funcionario_id", "regiao_id", "updated_at", "descricao") VALUES('2009-04-28 12:41:14.810998', 0, 0, '2009-04-28 12:41:14.810998', E'CENTRO') RETURNING "id"
---
  def create
    @roteiro = Roteiro.new(params[:roteiro])

    respond_to do |format|
      if @roteiro.save

SELECT * FROM "roteiros" WHERE ("roteiros"."id" = 953125641)
---
  def update
    @roteiro = Roteiro.find(params[:id])

SELECT * FROM "roteiros" WHERE ("roteiros"."id" = 953125641)
DELETE FROM "roteiros" WHERE "id" = 953125641
---
  def destroy
    @roteiro = Roteiro.find(params[:id])
    @roteiro.destroy